---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionReorderProfiles
source: html/dbd57f6b-7173-f370-14ca-5d58bf8174c1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionReorderProfiles Property

This form cannot be created due to self-intersecting geometry. Clicking the Reorder Profiles button will attempt to solve this problem.

## Syntax (C#)
```csharp
public static FailureDefinitionId FormElemRegenSelfIntersectionReorderProfiles { get; }
```